tests/performance/results/auth-load-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scenarios/auth-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * auth: Up to 10 looping VUs for 1m0s over 2 stages (gracefulRampDown: 15s, gracefulStop: 30s)


running (0m01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
auth   [   2% ] 00/10 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/10 VUs, 6 complete and 0 interrupted iterations
auth   [   3% ] 01/10 VUs  0m02.0s/1m00.0s

running (0m03.0s), 01/10 VUs, 19 complete and 0 interrupted iterations
auth   [   5% ] 01/10 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/10 VUs, 33 complete and 0 interrupted iterations
auth   [   7% ] 02/10 VUs  0m04.0s/1m00.0s

running (0m05.0s), 03/10 VUs, 47 complete and 0 interrupted iterations
auth   [   8% ] 03/10 VUs  0m05.0s/1m00.0s

running (0m06.0s), 03/10 VUs, 60 complete and 0 interrupted iterations
auth   [  10% ] 03/10 VUs  0m06.0s/1m00.0s

running (0m07.0s), 04/10 VUs, 71 complete and 0 interrupted iterations
auth   [  12% ] 04/10 VUs  0m07.0s/1m00.0s

running (0m08.0s), 05/10 VUs, 88 complete and 0 interrupted iterations
auth   [  13% ] 05/10 VUs  0m08.0s/1m00.0s

running (0m09.0s), 05/10 VUs, 102 complete and 0 interrupted iterations
auth   [  15% ] 05/10 VUs  0m09.0s/1m00.0s

running (0m10.0s), 06/10 VUs, 112 complete and 0 interrupted iterations
auth   [  17% ] 06/10 VUs  0m10.0s/1m00.0s

running (0m11.0s), 07/10 VUs, 124 complete and 0 interrupted iterations
auth   [  18% ] 07/10 VUs  0m11.0s/1m00.0s

running (0m12.0s), 07/10 VUs, 141 complete and 0 interrupted iterations
auth   [  20% ] 07/10 VUs  0m12.0s/1m00.0s

running (0m13.0s), 08/10 VUs, 157 complete and 0 interrupted iterations
auth   [  22% ] 08/10 VUs  0m13.0s/1m00.0s

running (0m14.0s), 09/10 VUs, 171 complete and 0 interrupted iterations
auth   [  23% ] 09/10 VUs  0m14.0s/1m00.0s

running (0m15.0s), 09/10 VUs, 180 complete and 0 interrupted iterations
auth   [  25% ] 09/10 VUs  0m15.0s/1m00.0s

running (0m16.0s), 10/10 VUs, 198 complete and 0 interrupted iterations
auth   [  27% ] 10/10 VUs  0m16.0s/1m00.0s

running (0m17.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
auth   [  28% ] 10/10 VUs  0m17.0s/1m00.0s

running (0m18.0s), 10/10 VUs, 224 complete and 0 interrupted iterations
auth   [  30% ] 10/10 VUs  0m18.0s/1m00.0s

running (0m19.0s), 10/10 VUs, 234 complete and 0 interrupted iterations
auth   [  32% ] 10/10 VUs  0m19.0s/1m00.0s

running (0m20.0s), 10/10 VUs, 252 complete and 0 interrupted iterations
auth   [  33% ] 10/10 VUs  0m20.0s/1m00.0s

running (0m21.0s), 10/10 VUs, 261 complete and 0 interrupted iterations
auth   [  35% ] 10/10 VUs  0m21.0s/1m00.0s

running (0m22.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
auth   [  37% ] 10/10 VUs  0m22.0s/1m00.0s

running (0m23.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
auth   [  38% ] 10/10 VUs  0m23.0s/1m00.0s

running (0m24.0s), 10/10 VUs, 308 complete and 0 interrupted iterations
auth   [  40% ] 10/10 VUs  0m24.0s/1m00.0s

running (0m25.0s), 10/10 VUs, 324 complete and 0 interrupted iterations
auth   [  42% ] 10/10 VUs  0m25.0s/1m00.0s

running (0m26.0s), 10/10 VUs, 334 complete and 0 interrupted iterations
auth   [  43% ] 10/10 VUs  0m26.0s/1m00.0s

running (0m27.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
auth   [  45% ] 10/10 VUs  0m27.0s/1m00.0s

running (0m28.0s), 10/10 VUs, 362 complete and 0 interrupted iterations
auth   [  47% ] 10/10 VUs  0m28.0s/1m00.0s

running (0m29.0s), 10/10 VUs, 378 complete and 0 interrupted iterations
auth   [  48% ] 10/10 VUs  0m29.0s/1m00.0s

running (0m30.0s), 10/10 VUs, 388 complete and 0 interrupted iterations
auth   [  50% ] 10/10 VUs  0m30.0s/1m00.0s

running (0m31.0s), 10/10 VUs, 407 complete and 0 interrupted iterations
auth   [  52% ] 10/10 VUs  0m31.0s/1m00.0s

running (0m32.0s), 10/10 VUs, 416 complete and 0 interrupted iterations
auth   [  53% ] 10/10 VUs  0m32.0s/1m00.0s

running (0m33.0s), 10/10 VUs, 431 complete and 0 interrupted iterations
auth   [  55% ] 10/10 VUs  0m33.0s/1m00.0s

running (0m34.0s), 10/10 VUs, 446 complete and 0 interrupted iterations
auth   [  57% ] 10/10 VUs  0m34.0s/1m00.0s

running (0m35.0s), 10/10 VUs, 458 complete and 0 interrupted iterations
auth   [  58% ] 10/10 VUs  0m35.0s/1m00.0s

running (0m36.0s), 10/10 VUs, 466 complete and 0 interrupted iterations
auth   [  60% ] 10/10 VUs  0m36.0s/1m00.0s

running (0m37.0s), 10/10 VUs, 485 complete and 0 interrupted iterations
auth   [  62% ] 10/10 VUs  0m37.0s/1m00.0s

running (0m38.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
auth   [  63% ] 10/10 VUs  0m38.0s/1m00.0s

running (0m39.0s), 10/10 VUs, 515 complete and 0 interrupted iterations
auth   [  65% ] 10/10 VUs  0m39.0s/1m00.0s

running (0m40.0s), 10/10 VUs, 527 complete and 0 interrupted iterations
auth   [  67% ] 10/10 VUs  0m40.0s/1m00.0s

running (0m41.0s), 10/10 VUs, 537 complete and 0 interrupted iterations
auth   [  68% ] 10/10 VUs  0m41.0s/1m00.0s

running (0m42.0s), 10/10 VUs, 555 complete and 0 interrupted iterations
auth   [  70% ] 10/10 VUs  0m42.0s/1m00.0s

running (0m43.0s), 10/10 VUs, 570 complete and 0 interrupted iterations
auth   [  72% ] 10/10 VUs  0m43.0s/1m00.0s

running (0m44.0s), 10/10 VUs, 582 complete and 0 interrupted iterations
auth   [  73% ] 10/10 VUs  0m44.0s/1m00.0s

running (0m45.0s), 10/10 VUs, 599 complete and 0 interrupted iterations
auth   [  75% ] 10/10 VUs  0m45.0s/1m00.0s

running (0m46.0s), 10/10 VUs, 608 complete and 0 interrupted iterations
auth   [  77% ] 10/10 VUs  0m46.0s/1m00.0s

running (0m47.0s), 10/10 VUs, 624 complete and 0 interrupted iterations
auth   [  78% ] 10/10 VUs  0m47.0s/1m00.0s

running (0m48.0s), 10/10 VUs, 638 complete and 0 interrupted iterations
auth   [  80% ] 10/10 VUs  0m48.0s/1m00.0s

running (0m49.0s), 10/10 VUs, 653 complete and 0 interrupted iterations
auth   [  82% ] 10/10 VUs  0m49.0s/1m00.0s

running (0m50.0s), 10/10 VUs, 669 complete and 0 interrupted iterations
auth   [  83% ] 10/10 VUs  0m50.0s/1m00.0s

running (0m51.0s), 10/10 VUs, 678 complete and 0 interrupted iterations
auth   [  85% ] 10/10 VUs  0m51.0s/1m00.0s

running (0m52.0s), 10/10 VUs, 695 complete and 0 interrupted iterations
auth   [  87% ] 10/10 VUs  0m52.0s/1m00.0s

running (0m53.0s), 10/10 VUs, 705 complete and 0 interrupted iterations
auth   [  88% ] 10/10 VUs  0m53.0s/1m00.0s

running (0m54.0s), 10/10 VUs, 721 complete and 0 interrupted iterations
auth   [  90% ] 10/10 VUs  0m54.0s/1m00.0s

running (0m55.0s), 10/10 VUs, 738 complete and 0 interrupted iterations
auth   [  92% ] 10/10 VUs  0m55.0s/1m00.0s

running (0m56.0s), 10/10 VUs, 747 complete and 0 interrupted iterations
auth   [  93% ] 10/10 VUs  0m56.0s/1m00.0s

running (0m57.0s), 10/10 VUs, 764 complete and 0 interrupted iterations
auth   [  95% ] 10/10 VUs  0m57.0s/1m00.0s

running (0m58.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
auth   [  97% ] 10/10 VUs  0m58.0s/1m00.0s

running (0m59.0s), 10/10 VUs, 792 complete and 0 interrupted iterations
auth   [  98% ] 10/10 VUs  0m59.0s/1m00.0s

running (1m00.0s), 10/10 VUs, 802 complete and 0 interrupted iterations
auth   [ 100% ] 10/10 VUs  1m00.0s/1m00.0s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.02' rate=0.00%

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    lat_analytics
    ✓ 'p(95)<2000' p(95)=0s
    ✓ 'p(99)<5000' p(99)=0s

    lat_auth_light
    ✓ 'p(95)<300' p(95)=0s
    ✓ 'p(99)<800' p(99)=0s

    lat_dashboard
    ✓ 'p(95)<1600' p(95)=0s
    ✓ 'p(99)<4000' p(99)=0s

    lat_list_read
    ✓ 'p(95)<1000' p(95)=0s
    ✓ 'p(99)<2400' p(99)=0s

    lat_login
    ✓ 'p(95)<3000' p(95)=1.05s
    ✓ 'p(99)<6000' p(99)=1.19s

    lat_simple_read
    ✓ 'p(95)<600' p(95)=0s
    ✓ 'p(99)<1400' p(99)=0s

    lat_write
    ✓ 'p(95)<1200' p(95)=0s
    ✓ 'p(99)<3000' p(99)=0s


  █ TOTAL RESULTS 

    checks_total.......: 1624    26.98235/s
    checks_succeeded...: 100.00% 1624 out of 1624
    checks_failed......: 0.00%   0 out of 1624

    ✓ login succeeded or was rate limited
    ✓ login returned a token

    CUSTOM
    business_errors................: 0.00%  0 out of 812
    err_login......................: 0.00%  0 out of 812
    lat_analytics..................: avg=0s       min=0s      med=0s       p(90)=0s       p(95)=0s    p(99)=0s    max=0s   
    lat_auth_light.................: avg=0s       min=0s      med=0s       p(90)=0s       p(95)=0s    p(99)=0s    max=0s   
    lat_dashboard..................: avg=0s       min=0s      med=0s       p(90)=0s       p(95)=0s    p(99)=0s    max=0s   
    lat_list_read..................: avg=0s       min=0s      med=0s       p(90)=0s       p(95)=0s    p(99)=0s    max=0s   
    lat_login......................: avg=637.84ms min=72.17ms med=661.27ms p(90)=864.64ms p(95)=1.05s p(99)=1.19s max=1.26s
    lat_simple_read................: avg=0s       min=0s      med=0s       p(90)=0s       p(95)=0s    p(99)=0s    max=0s   
    lat_write......................: avg=0s       min=0s      med=0s       p(90)=0s       p(95)=0s    p(99)=0s    max=0s   

    HTTP
    http_req_duration..............: avg=637.84ms min=72.17ms med=661.27ms p(90)=864.64ms p(95)=1.05s p(99)=1.19s max=1.26s
      { expected_response:true }...: avg=637.84ms min=72.17ms med=661.27ms p(90)=864.64ms p(95)=1.05s p(99)=1.19s max=1.26s
    http_req_failed................: 0.00%  0 out of 812
    http_reqs......................: 812    13.491175/s

    EXECUTION
    iteration_duration.............: avg=638.06ms min=73.39ms med=661.65ms p(90)=864.63ms p(95)=1.05s p(99)=1.19s max=1.26s
    iterations.....................: 812    13.491175/s
    vus............................: 10     min=0        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 1.1 MB 19 kB/s
    data_sent......................: 170 kB 2.8 kB/s



running (1m00.2s), 00/10 VUs, 812 complete and 0 interrupted iterations
auth ✓ [ 100% ] 00/10 VUs  1m0s